app/Models/usuario_Model.php

SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'
---
    public function getUsuarios(){

            return $this->where('baja', 'NO')->findAll();

UPDATE `usuarios` SET `baja` = 'SI'
WHERE `usuarios`.`id_usuario` IN ('46')
---
    public function DarBaja($id_usuario) {
        $data = ['baja' => 'SI'];

        $this->update($id_usuario, $data);